---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Roughness
source: html/e7047478-45b1-a611-86da-3e1e2b214870.htm
---
# Autodesk.Revit.DB.Mechanical.DuctPressureDropData.Roughness Property

The roughness of the duct. Units: (ft).

## Syntax (C#)
```csharp
public double Roughness { get; }
```